#include"all.h"

void menu0()
{
	cout << "\033[38;5;214m" << "===================== " << endl;
	cout << "|    仓库管理系统    | " << endl;
	cout << "--------------------- " << endl;
	cout << "|    1.货物入库      | " << endl;
	cout << "|    2.货物出库      | " << endl;
	cout << "|    3.查寻货物      | " << endl;
	cout << "|    4.清空库存      | " << endl;
	cout << "|    5.显示当前库存  | " << endl;
	cout << "|    0.退出系统      | " << endl;
	cout << "===================== " << "\033[0m" << endl;
}

void menu3()
{
	cout << "\033[38;5;214m" << "===================== " << endl;
	cout << "|      查寻货物      | " << endl;
	cout << "--------------------- " << endl;
	cout << "|    1.按名称查找    | " << endl;
	cout << "|    2.按编号查找    | " << endl;
	cout << "|    0.返回上级菜单  | " << endl;
	cout << "===================== " << "\033[0m" << endl;
}